# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8l.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Pass, []] # 0
  - [0, 1, Get_Img, []] # 1
  - [-1, 1, Conv, [64, 3, 2]] # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P2/4
  - [-1, 3, C2f, [128, True]] # 4
  - [[4, 0], 1, PearsonRSM, [128, 768, 0]] # 5
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  - [-1, 6, C2f, [256, True]] # 7
  - [[7, 0], 1, PearsonRSM, [256, 768, 1]] # 8
  - [-1, 1, Conv, [512, 3, 2]] # 9-P4/16
  - [-1, 6, C2f, [512, True]] # 10
  - [[10, 0], 1, PearsonRSM, [512, 768, 2]] # 11
  - [-1, 1, Conv, [1024, 3, 2]] # 12-P5/32
  - [-1, 3, C2f, [1024, True]] # 13
  - [[13, 0], 1, PearsonRSM, [512, 768, 3]] # 14
  - [-1, 1, SPPF, [1024, 5]] # 15

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 11], 1, W_Concat_two, [1]] # 17
  - [-1, 3, C2f, [512]] # 18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 8], 1, W_Concat_two, [1]] # 20
  - [-1, 3, C2f, [256]] # 21 (P3/8-small)

  - [-1, 1, Maxpool2_Add, []] # 22
  - [-1, 1, Conv_Add, [512, 1, 1]] # 23
  - [[-1, 18], 1, W_Add_Tanh, [[0, 0]]] # 24
  - [-1, 1, Maxpool2_Add, []] # 25
  - [[-1, 15], 1, W_Add_Tanh, [[-0.3, 0]]] # 26

  - [21, 1, Conv, [256, 3, 2]] # 27
  - [[-1, 18], 1, W_Concat_two, [1]] # 28
  - [-1, 3, C2f, [512]] # 29 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 30
  - [[-1, 26], 1, W_Concat_two, [1]] # 31
  - [-1, 3, C2f, [1024]] # 32 (P5/32-large)

  - [-1, 1, ConvTranspose_Add, [512, 2, 2, 0]] # 33 args:[c2, k, s, p]
  - [[-1, 29], 1, W_Add_Tanh, [[0, 0]]] # 34
  - [-1, 1, ConvTranspose_Add, [256, 2, 2, 0]] # 35
  - [[-1, 21], 1, W_Add_Tanh, [[-0.3, 0]]] # 36
  - [-1, 1, Conv_Add, [256, 3, 1]] # 37

  - [[8, 21, 37], 1, W_Add_Tanh, [[-0.5, 0.5, 0]]] # 38
  - [[11, 18, 29], 1, W_Add_Tanh, [[-0.5, 0, 0.5]]] # 39
  - [[15, 26, 32], 1, W_Add_Tanh, [[-0.5, 0, 0.5]]] # 40

  - [38, 1, Conv_Add, [256, 3, 1]] # 41
  - [-1, 1, Conv_Add, [256, 3, 2]] # 42
  - [39, 1, Conv_Add, [256, 3, 1]] # 43
  - [40, 1, Conv_Add, [256, 3, 1]] # 44
  - [-1, 1, ConvTranspose_Add, [256, 2, 2, 0]] # 45

  - [[42, 43, 45], 1, W_Add, []] # 46
  - [-1, 1, Conv_Add, [256, 3, 1]] # 47
  - [[-1, 0], 1, Ripple_Attention_Linear, [256, 768, 16, 0.4, 3]] # 48
  - [-1, 1, Conv_Add, [256, 3, 1]] # 49

  - [49, 1, ConvTranspose_Add, [256, 2, 2, 0]] # 50
  - [[41, 50], 1, W_Add_Tanh, [[0, 0]]] # 51
  - [[43, 49], 1, W_Add_Tanh, [[0, 0]]] # 52
  - [49, 1, Conv_Add, [256, 3, 2]] # 53
  - [[44, 53], 1, W_Add_Tanh, [[0, 0]]] # 54

  - [[51, 52, 54], 1, Detect, [nc]] # 55 Detect(P3, P4, P5)
